package com.hillel.qa.java.branching.homework;

public class HomeWork3 {
    /**
     * <h1>Вимоги</h1>
     * <p style="font-size:12px">
     * 1. Оплата за товар проводитиметься способами:
     * <br>
     * - готівкою, додаткова комісія не стягується;
     * <br>
     * - карткою, стягується додаткова комісія 2% від суми купівлі.
     * <br>
     * - за рахунком, стягується додаткова комісія 5% від суми купівлі.
     * <br>
     * 2. Сума купівлі (призначити самостійно) сплачена карткою.
     * <br>
     * 3. Виведіть суму для оплати (сума купівлі з урахуванням суми комісії).
     * <br>
     * 4. Врахуйте варіанти виведення, коли немає відповідності будь-якому способу оплати.
     * <br>
     * 5. Завдання необхідно виконати за допомогою switch case
     * </p>
     */
    public static void main(String[] args) {
        String payment = "Card";
        int sum = 200;
        int pay = sum - (sum*2/100);
        switch (payment) {
            case "Cash": System.out.println("Додаткова комісія не стягується");
            break;
            case "Card": System.out.println("Стягується додаткова комісія 2% від суми купівлі. До сплати:" + pay );
        break;
            case "Bill": System.out.println("Стягується додаткова комісія 5% від суми купівлі");
       break;
            default: System.out.println("Hемає відповідності будь-якому способу оплати");
        }
    }}